Catalogs/СкладскиеПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СкладскиеПомещения</Name>
			<Comment>JIRA№ A2105505-751</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАдресноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАдресноеХранениеСправочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаАдресногоХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НастройкиАдресногоХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжностьОтветственного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеРабочихУчастков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИспользованиеСкладскихРабочихУчастков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаАдресногоХраненияОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_ТипСкладскогоПомещения</Name>
					<Comment>JIRA№ A2105505-751</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КР_ТипыСкладскихПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиАдресныхСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАдресныхСкладов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаАнализа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяВероятностьОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаX</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаY</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаZ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрогнозРасходаУпаковок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеРасчетаПоказателейПрогноза</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАдресноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАдресноеХранениеСправочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеУчастки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРегламентноеЗаданиеСозданиеЗаданийНаПодпитку</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеСозданиеЗаданийНаОтбор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьРегламентноеЗаданиеСозданияЗаданийНаПодпитку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаФормированияПоРабочимУчасткамОтбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиватьПоВесуОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиватьПоОбъемуОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоОбъемуОтбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоВесуОтбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийУчастокОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеУчастки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАдресногоХраненияОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентныеЗаданияСозданияЗаданийНаПеремещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КР_ИспользоватьРазмещениеКакПриходныйОрдер</Name>
					<Comment>JIRA№A2105505-751</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КР_АдресныйСкладБезордернойОтгрузки</Name>
					<Comment>JIRA№A2105505-751</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КР_ТипыСкладскихПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КР_ТипыСкладскихПомещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкладМагазина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйЗал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйСкладМагазина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетТорговля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НастройкиАдресногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НастройкиАдресногоХранения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяНастройкамиПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯчейкиСправочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯчейкиОстатки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИспользованиеСкладскихРабочихУчастков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИспользованиеСкладскихРабочихУчастков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяНастройкамиПомещения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СкладскиеПомещения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
//
// Возвращаемое значение:
//	Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("Владелец");
	Результат.Добавить("НастройкаАдресногоХранения");
	Результат.Добавить("ДатаНачалаАдресногоХраненияОстатков");
	Возврат Результат;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Владелец")
		Или Не ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КР_ДобавленныеПроцедурыИФункции  

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// << 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
// Возвращает первое не помеченное на удаление помещение с типом СкладМагазина, 
//	владельцем которого является указанный склад
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад по которому требуется получить помещение
//
// Возвращаемое значение:
//   СправочникСсылка.СкладскиеПомещения - Элемент справочника или пустое значение
//
Функция КР_СкладскоеПомещениеПоТипу(ТипСкладскогоПомещения, Склад, НаДату) Экспорт 

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладскиеПомещения КАК Т
	|		ПО Склады.Ссылка = Т.Владелец
	|			И (НЕ Т.ПометкаУдаления)
	|			И (Т.КР_ТипСкладскогоПомещения = &ТипСкладскогоПомещения)
	|ГДЕ
	|	Склады.Ссылка = &Склад
	|	И Склады.ИспользоватьСкладскиеПомещения
	|	И Склады.ДатаНачалаИспользованияСкладскихПомещений <= &НаДату");  
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТипСкладскогоПомещения", ТипСкладскогоПомещения);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	РезультатЗапроса = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	Иначе
	    Возврат Справочники.СкладскиеПомещения.ПустаяСсылка();
	КонецЕсли;

КонецФункции // >> 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
// Возвращает первое не помеченное на удаление помещение с типом СкладМагазина, 
//	владельцем которого является указанный склад
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад по которому требуется получить помещение
//
// Возвращаемое значение:
//   СправочникСсылка.СкладскиеПомещения - Элемент справочника или пустое значение
//
Функция КР_СкладскоеПомещениеСкладМагазина(Склад, Знач НаДату = Неопределено) Экспорт 

	Если НаДату = Неопределено Тогда 
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат КР_СкладскоеПомещениеПоТипу(Перечисления.КР_ТипыСкладскихПомещений.СкладМагазина, Склад, НаДату);	

КонецФункции // >> 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
// Возвращает первое не помеченное на удаление помещение с типом ТорговыйЗал, 
//	владельцем которого является указанный склад
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад по которому требуется получить помещение
//
// Возвращаемое значение:
//   СправочникСсылка.СкладскиеПомещения - Элемент справочника или пустое значение
//
Функция КР_СкладскоеПомещениеТорговыйЗал(Склад, Знач НаДату = Неопределено) Экспорт 

	Если НаДату = Неопределено Тогда 
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат КР_СкладскоеПомещениеПоТипу(Перечисления.КР_ТипыСкладскихПомещений.ТорговыйЗал, Склад, НаДату);	
	
КонецФункции // >> 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
// Возвращает первое не помеченное на удаление помещение с типом ТорговыйЗал, 
//	владельцем которого является указанный склад
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад по которому требуется получить помещение
//
// Возвращаемое значение:
//   СправочникСсылка.СкладскиеПомещения - Элемент справочника или пустое значение
//
Функция КР_СкладскоеПомещениеИнтернетТорговля(Склад, Знач НаДату = Неопределено) Экспорт 

	Если НаДату = Неопределено Тогда 
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат КР_СкладскоеПомещениеПоТипу(Перечисления.КР_ТипыСкладскихПомещений.ИнтернетТорговля, Склад, НаДату);	
	
КонецФункции // >> 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
// Возвращает первое не помеченное на удаление помещение с ИспользоватьАдресноеХранение = Истина, 
//	владельцем которого является указанный склад
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад по которому требуется получить помещение
//
// Возвращаемое значение:
//   СправочникСсылка.СкладскиеПомещения - Элемент справочника или пустое значение
//
Функция КР_СкладскоеПомещениеСАдреснымХранением(Склад) Экспорт 

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеПомещения КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И Т.Владелец = &Склад
	|	И Т.ИспользоватьАдресноеХранение");  
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	Иначе
	    Возврат Справочники.СкладскиеПомещения.ПустаяСсылка();
	КонецЕсли;

КонецФункции // >> 02.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 01.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1262
Функция КР_СоздатьСкладскоеПомещениеПоТипу(Склад, ТипСкладскогоПомещения, Обновлять = Ложь) Экспорт

	Если Не ЗначениеЗаполнено(Склад)
		Или Не ЗначениеЗаполнено(ТипСкладскогоПомещения) Тогда 
	    Возврат Справочники.СкладскиеПомещения.ПустаяСсылка();
	КонецЕсли;
	
	// Сформируем данные для GUID 
	ДанныеДляGUID = XMLСтрока(Склад) + XMLСтрока(ТипСкладскогоПомещения);
	GUID = КР_ОбщегоНазначениеСервер.GUIDИзСтроки(ДанныеДляGUID);
	
	Ссылка = XMLЗначение(Тип("СправочникСсылка.СкладскиеПомещения"), GUID);
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда 
		
		ПомещениеОбъект = Справочники.СкладскиеПомещения.СоздатьЭлемент();  
		ПомещениеОбъект.УстановитьСсылкуНового(Ссылка);
		ПомещениеОбъект.Владелец = Склад;
		ПомещениеОбъект.КР_ТипСкладскогоПомещения = ТипСкладскогоПомещения;
		
	Иначе  
		
		Если Не Обновлять Тогда 
			Возврат Ссылка;   
		КонецЕсли;
		
		ПомещениеОбъект = Ссылка.ПолучитьОбъект();
		
	КонецЕсли;	    
	
	ТипыСкладскихПомещений = Перечисления.КР_ТипыСкладскихПомещений;
	НастройкиАдресногоХранения = Перечисления.НастройкиАдресногоХранения;
	ИспользованиеСкладскихРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков;
	
	//
	ПомещениеОбъект.Наименование = ТипСкладскогоПомещения;
	ПомещениеОбъект.ИспользованиеРабочихУчастков = ИспользованиеСкладскихРабочихУчастков.НеИспользовать;
	Если ТипСкладскогоПомещения = ТипыСкладскихПомещений.СкладМагазина Тогда 
		ПомещениеОбъект.ИспользоватьАдресноеХранение = Истина;
		ПомещениеОбъект.НастройкаАдресногоХранения = НастройкиАдресногоХранения.ЯчейкиОстатки;
	ИначеЕсли ТипСкладскогоПомещения = ТипыСкладскихПомещений.ТорговыйЗал
		Или ТипСкладскогоПомещения = ТипыСкладскихПомещений.ИнтернетТорговля Тогда
		ПомещениеОбъект.ИспользоватьАдресноеХранение = Ложь;
		ПомещениеОбъект.НастройкаАдресногоХранения = НастройкиАдресногоХранения.НеИспользовать;   
	Иначе 
		ТекстИсключения = НСтр("ru = 'Не определена логика формирования складского помещения на основании типа %1'");  
		ТекстИсключения = СтрШаблон(ТекстИсключения, ТипСкладскогоПомещения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;

	ПомещениеОбъект.ОбменДанными.Загрузка = Истина;
	ПомещениеОбъект.Записать();
	
	// A2105505-1599 
	// Так как запись помещения происходит в режиме Загрузка = Истина то надо выполнить код "При записи"
	РегистрыСведений.НастройкиАдресныхСкладов.УстановитьНастройкиПоУмолчанию(
		ПомещениеОбъект.Владелец,
		ПомещениеОбъект.Ссылка,
		ПомещениеОбъект.ИспользоватьАдресноеХранение,
		ПомещениеОбъект.ДатаНачалаАдресногоХраненияОстатков,
		ПомещениеОбъект.ИспользоватьАдресноеХранениеСправочно,
		ПомещениеОбъект.ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать,
		ПомещениеОбъект.ЭтоНовый());
	//
	
	Возврат Ссылка;
	
КонецФункции // >> 01.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1262

#КонецОбласти

#КонецЕсли

#КонецОбласти
